# Decision Tree Classification

In [12]:
import pandas as pd
df=pd.read_csv(r'E:\1biplav\data\Dataset\salaries.csv')

In [13]:
df.head(2)

  company              job     degree  salary_more_then_100k
0  google  sales executive  bachelors                      0
1  google  sales executive    masters                      0

In [14]:
df['salary_more_then_100k'].value_counts()

1    10
0     6
Name: salary_more_then_100k, dtype: int64

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 4 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   company                16 non-null     object
 1   job                    16 non-null     object
 2   degree                 16 non-null     object
 3   salary_more_then_100k  16 non-null     int64
dtypes: int64(1), object(3)
memory usage: 640.0+ bytes

In [16]:
df.columns

Index(['company', 'job', 'degree', 'salary_more_then_100k'], dtype='object')

In [17]:
X=df.drop('salary_more_then_100k',axis=1)
y=df["salary_more_then_100k"]
print("shape of X =",X.shape)
print("shape of y =",y.shape)

shape of X = (16, 3)
shape of y = (16,)

In [18]:
from sklearn.preprocessing import LabelEncoder
le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [19]:
X['le_company']=le_company.fit_transform(X['company'])
X['le_job']=le_job.fit_transform(X['job'])
X['le_degree']=le_degree.fit_transform(X['degree'])

In [20]:
X

       company                  job     degree  le_company  le_job  le_degree
0       google      sales executive  bachelors           2       2          0
1       google      sales executive    masters           2       2          1
2       google     business manager  bachelors           2       0          0
3       google     business manager    masters           2       0          1
4       google  computer programmer  bachelors           2       1          0
5       google  computer programmer    masters           2       1          1
6   abc pharma      sales executive    masters           0       2          1
7   abc pharma  computer programmer  bachelors           0       1          0
8   abc pharma     business manager  bachelors           0       0          0
9   abc pharma     business manager    masters           0       0          1
10    facebook      sales executive  bachelors           1       2          0
11    facebook      sales executive    masters           1       2          1
12    facebook     business manager  bachelors           1       0          0
13    facebook     business manager    masters           1       0          1
14    facebook  computer programmer  bachelors           1       1          0
15    facebook  computer programmer    masters           1       1          1

In [23]:
X_1=X.drop(['company', 'job', 'degree'],axis=1)

In [24]:
X_1.head(2)

   le_company  le_job  le_degree
0           2       2          0
1           2       2          1

In [25]:
y

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_100k, dtype: int64

In [27]:
from sklearn.tree import DecisionTreeClassifier

In [29]:
model=DecisionTreeClassifier()
model.fit(X_1,y)

DecisionTreeClassifier()

In [31]:
model.score(X_1,y)

1.0

In [30]:
model.predict([[2,1,0]])

array([0], dtype=int64)